org/blog/Python/python-for-everybody-notes.org
#+title: Python for everybody course notes
#+date: <2022-05-19 Thu>
#+author: Morgan Walsh
#+subtitle: Notes on Python course: [[https://www.py4e.com/lessons][py4e]]
#+description: Learn about component state and the component lifecycle.
#+keywords: React JavaScript HTML

---------------

* Install Python

** Ubuntu

To install Python on Ubuntu, use the ~apt~ package manager:

#+caption: Python 3 (default)
#+begin_src shell eval: no
  sudo apt-get install python3
#+end_src

#+caption: Python 3.8
#+begin_src shell eval: no
  sudo apt-get install python3.8
#+end_src

#+caption: Python 2
#+begin_src shell eval: no
  sudo apt-get install python
#+end_src

** Windows

Navigate to [[https://python.org]] and head to the ~Downloads~ page to find executable installers for Python.

[[https://www.python.org/downloads/windows/][Python.org | Windows downloads page]]

* Chapter 1: Why should you learn to write programs?

Programs are good at repeating and carrying out complex tasks which humans may struggle to accurately and consistently perform.

------------------------

** Computer hardware architecture

How parts of a computer might look:

#+begin_example
                -----------
               |  Software |
               |  -------  |        ------------------
[IO Devices]---|-|  CPU  |-|-------| Network          |
               |  -------  |        ------------------
               |     |     |
               |  -------  |        ------------------
               | | Main  |-|-------| Secondary memory |
               | | Memory| |        ------------------
               |  -------  |
               |           |
                -----------
#+end_example

High-level definitions:

- Central Processing Unit (CPU) is the brain of the computer, it carries out calculations at a specific /clock speed/. If a CPU had a clock speed of 3.0GHz, it can perform three billion processor instructions per second. (~Hz~ (Hertz) means times per second while ~G~ (giga) is an SI prefix that means billion.
- Main memory stores information that the CPU needs, such as currently running programs. Main memory has historically been referred to as /RAM/ (Random Access Memory) and is nearly as fast as the CPU. It is a volatile memory that does not persist between restarts.
- Secondary memory are storage devices for storing information, such as HDDs, SSDs, disk drives, flash memory, etc...
- IO devices connect to the computer to allow input and output, these are things like keyboards, mice, monitors, etc...
- Network connections allow computers to retrieve data over a network. Networks can be considered a slower form of secondary memory used for storing and retrieving data, although the difference is that it relies on our internet connectivity speed and the network we are connecting to being up.

Instead of instructing the CPU directly, and its components, with complex instructions directly, we write /programs/ which consist of instructions to be executed.

** Understanding programming

Two skills required to be a programmer:

- Need to know a programming language, along with its vocaublary and grammer - known as its *syntax*.
- Need to be able to tell a story in code that conveys ideas to solve a problem. The /story/ is the program, and the /idea/ is the problem trying to be solved.

Once you can program in one language, you can program in many languages...

** Words and sentences

Pythons vocabulary, like most programming languages, is small. It's vocabulary is referred to as *reserved words*, these have a special meaning in Python programs:

#+begin_example
and del global not with
as elif if or yield
assert else import pass
break except in raise
class finally is return
continue for lambda try
def from nonlocal while
#+end_example

We cannot create variables that have the same name as a reserved keyword in Python.

To print a string of text to the console in Python, use the ~print()~ function:

#+begin_src python :results output :exports both :eval no-export
  print('hello world')
#+end_src

This prints the following text to the console like so:

#+RESULTS:
: hello world

** Conversing with Python

To start interacting with Python, the Python interpreter can be opened by entering ~python~ into a terminal application if it is installed and available on your local path:

#+caption: Python interpreter
#+begin_src shell :eval no
  Python 3.8.10 (default, Mar 15 2022, 12:22:08) 
  [GCC 9.4.0] on linux
  Type "help", "copyright", "credits" or "license" for more information.
  >>>
#+end_src

The ~>>>~ prompt is used to indicate we write input here. Type ~quite()~ in the interactive prompt to exit the interpreter.

** Terminology: Interpreter and compiler

Python is a high-level interpreted language, the actual CPU itself does not understand the Python instructions we write. Instead, the CPU understands a binary code known as *machine language*:

#+begin_example
010010010101010101010101
#+end_example

- CPUs speak in 0's and 1's

Interpreters read the source code of a program, parse it and interpret the instructions when we activate the interpreter - interpreters are having an open conversation with the computer.

Compilers read an entire programs source code and transforms it into machine language for the computer to understand.

Compiled Windows programs often end in ~.exe~ (executable) or ~.dll~ (dynamic link library) whilst compiled Linux and Macintosh programs don't require suffixes to mark a program as executable.

The Python interpreter is written in ~C~, and is open-sourced.

** Writing a program

Typing commands into the interpreter allows for interactive programming, but is not good for solving complex problems. Python allows us to write text files known as *scripts*, with the file ending ~.py~, to store executable Python code.

To execute python code stored in a file, we call the Python interpreter and pass it the file name:

#+begin_src shell :results output :exports both :eval no-export
  cd ~
  echo "print('hello world')" > hello.py
  python3 hello.py
  rm hello.py
#+end_src

Running the file then outputs:

#+RESULTS:
: hello world

After running the file, I used the ~rm~ command to remove it afterwards as it was only temporary.

