blog/Python/python-for-everybody-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-26 Thu 22:42 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python for everybody course notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Learn about component state and the component lifecycle."
>
<meta name="keywords" content="React JavaScript HTML">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Python for everybody course notes</h1>
<p class="subtitle">Notes on Python course: <a href="https://www.py4e.com/lessons">py4e</a></p>
</header><hr>

<div id="outline-container-orgce71cf8" class="outline-2">
<h2 id="orgce71cf8">Install Python</h2>
<div class="outline-text-2" id="text-orgce71cf8">
</div>
<div id="outline-container-org8efac48" class="outline-3">
<h3 id="org8efac48">Ubuntu</h3>
<div class="outline-text-3" id="text-org8efac48">
<p>
To install Python on Ubuntu, use the <code>apt</code> package manager:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Python 3 (default)</label><pre class="src src-shell">sudo apt-get install python3
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Python 3.8</label><pre class="src src-shell">sudo apt-get install python3.8
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Python 2</label><pre class="src src-shell">sudo apt-get install python
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ef3553" class="outline-3">
<h3 id="org6ef3553">Windows</h3>
<div class="outline-text-3" id="text-org6ef3553">
<p>
Navigate to <a href="https://python.org">https://python.org</a> and head to the <code>Downloads</code> page to find executable installers for Python.
</p>

<p>
<a href="https://www.python.org/downloads/windows/">Python.org | Windows downloads page</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org734deaa" class="outline-2">
<h2 id="org734deaa">Chapter 1: Why should you learn to write programs?</h2>
<div class="outline-text-2" id="text-org734deaa">
<p>
Programs are good at repeating and carrying out complex tasks which humans may struggle to accurately and consistently perform.
</p>

<hr>
</div>

<div id="outline-container-org35ae677" class="outline-3">
<h3 id="org35ae677">Computer hardware architecture</h3>
<div class="outline-text-3" id="text-org35ae677">
<p>
How parts of a computer might look:
</p>

<pre class="example">
                -----------
               |  Software |
               |  -------  |        ------------------
[IO Devices]---|-|  CPU  |-|-------| Network          |
               |  -------  |        ------------------
               |     |     |
               |  -------  |        ------------------
               | | Main  |-|-------| Secondary memory |
               | | Memory| |        ------------------
               |  -------  |
               |           |
                -----------
</pre>

<p>
High-level definitions:
</p>

<ul class="org-ul">
<li>Central Processing Unit (CPU) is the brain of the computer, it carries out calculations at a specific <i>clock speed</i>. If a CPU had a clock speed of 3.0GHz, it can perform three billion processor instructions per second. (<code>Hz</code> (Hertz) means times per second while <code>G</code> (giga) is an SI prefix that means billion.</li>
<li>Main memory stores information that the CPU needs, such as currently running programs. Main memory has historically been referred to as <i>RAM</i> (Random Access Memory) and is nearly as fast as the CPU. It is a volatile memory that does not persist between restarts.</li>
<li>Secondary memory are storage devices for storing information, such as HDDs, SSDs, disk drives, flash memory, etc&#x2026;</li>
<li>IO devices connect to the computer to allow input and output, these are things like keyboards, mice, monitors, etc&#x2026;</li>
<li>Network connections allow computers to retrieve data over a network. Networks can be considered a slower form of secondary memory used for storing and retrieving data, although the difference is that it relies on our internet connectivity speed and the network we are connecting to being up.</li>
</ul>

<p>
Instead of instructing the CPU directly, and its components, with complex instructions directly, we write <i>programs</i> which consist of instructions to be executed.
</p>
</div>
</div>

<div id="outline-container-orgd834d25" class="outline-3">
<h3 id="orgd834d25">Understanding programming</h3>
<div class="outline-text-3" id="text-orgd834d25">
<p>
Two skills required to be a programmer:
</p>

<ul class="org-ul">
<li>Need to know a programming language, along with its vocaublary and grammer - known as its <b>syntax</b>.</li>
<li>Need to be able to tell a story in code that conveys ideas to solve a problem. The <i>story</i> is the program, and the <i>idea</i> is the problem trying to be solved.</li>
</ul>

<p>
Once you can program in one language, you can program in many languages&#x2026;
</p>
</div>
</div>

<div id="outline-container-org8f54dda" class="outline-3">
<h3 id="org8f54dda">Words and sentences</h3>
<div class="outline-text-3" id="text-org8f54dda">
<p>
Pythons vocabulary, like most programming languages, is small. It's vocabulary is referred to as <b>reserved words</b>, these have a special meaning in Python programs:
</p>

<pre class="example">
and del global not with
as elif if or yield
assert else import pass
break except in raise
class finally is return
continue for lambda try
def from nonlocal while
</pre>

<p>
We cannot create variables that have the same name as a reserved keyword in Python.
</p>

<p>
To print a string of text to the console in Python, use the <code>print()</code> function:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'hello world'</span>)
</pre>
</div>

<p>
This prints the following text to the console like so:
</p>

<pre class="example">
hello world

</pre>
</div>
</div>

<div id="outline-container-org3d7b403" class="outline-3">
<h3 id="org3d7b403">Conversing with Python</h3>
<div class="outline-text-3" id="text-org3d7b403">
<p>
To start interacting with Python, the Python interpreter can be opened by entering <code>python</code> into a terminal application if it is installed and available on your local path:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Python interpreter</label><pre class="src src-shell">Python 3.8.10 (default, Mar 15 2022, 12:22:08) 
[GCC 9.4.0] on linux
Type <span style="font-style: italic;">"help"</span>, <span style="font-style: italic;">"copyright"</span>, <span style="font-style: italic;">"credits"</span> or <span style="font-style: italic;">"license"</span> for more information.
&gt;&gt;&gt;
</pre>
</div>

<p>
The <code>&gt;&gt;&gt;</code> prompt is used to indicate we write input here. Type <code>quite()</code> in the interactive prompt to exit the interpreter.
</p>
</div>
</div>

<div id="outline-container-org4011e7e" class="outline-3">
<h3 id="org4011e7e">Terminology: Interpreter and compiler</h3>
<div class="outline-text-3" id="text-org4011e7e">
<p>
Python is a high-level interpreted language, the actual CPU itself does not understand the Python instructions we write. Instead, the CPU understands a binary code known as <b>machine language</b>:
</p>

<pre class="example">
010010010101010101010101
</pre>

<ul class="org-ul">
<li>CPUs speak in 0's and 1's</li>
</ul>

<p>
Interpreters read the source code of a program, parse it and interpret the instructions when we activate the interpreter - interpreters are having an open conversation with the computer.
</p>

<p>
Compilers read an entire programs source code and transforms it into machine language for the computer to understand.
</p>

<p>
Compiled Windows programs often end in <code>.exe</code> (executable) or <code>.dll</code> (dynamic link library) whilst compiled Linux and Macintosh programs don't require suffixes to mark a program as executable.
</p>

<p>
The Python interpreter is written in <code>C</code>, and is open-sourced.
</p>
</div>
</div>

<div id="outline-container-org0865760" class="outline-3">
<h3 id="org0865760">Writing a program</h3>
<div class="outline-text-3" id="text-org0865760">
<p>
Typing commands into the interpreter allows for interactive programming, but is not good for solving complex problems. Python allows us to write text files known as <b>scripts</b>, with the file ending <code>.py</code>, to store executable Python code.
</p>

<p>
To execute python code stored in a file, we call the Python interpreter and pass it the file name:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> ~
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"print('hello world')"</span> &gt; hello.py
python3 hello.py
rm hello.py
</pre>
</div>

<p>
Running the file then outputs:
</p>

<pre class="example">
hello world

</pre>

<p>
After running the file, I used the <code>rm</code> command to remove it afterwards as it was only temporary.
</p>
</div>
</div>
