org/blog/Python/python-for-everybody-notes.org
** The building blocks of programs

Low-level conceptual patterns applied to all programming languages:

- *Input*: Get data from the outside world using input devices
- *Output*: Send data to output devices.
- *Sequential execution*: Perform statements one after the other
- *Conditional execution*: Execute or skip sequences of statements based on conditions
- *Repeated execution*: Repeat a set of statements, usually upto a set limit
- *Reuse*: Sets of instructions can be named and reused throughout a program

** What could possibly go wrong?

Python has many different kinds of error, these indicate something went wrong. If we pass a malformed string to the ~print()~ function, we will get a ~SyntaxError~ indicating Python doesn't quite understand what we are trying to tell it to do:

#+caption: malformed call to print()
#+begin_src python :results output :exports both :eval no
  print(hello world')
#+end_src

This results in the following error:

#+RESULTS:
: File "<stdin>", line 1
:   print(hello world')
:               ^
: SyntaxError: invalid syntax

Pythons different errors include:

- *Syntax errors*: These errors indicate a violation of the languages syntax
- *Logic errors*: These errors indicate the syntax is good, but there is a mistake in how we have applied different operations...
- *Semantic errors*: The syntax is correct, the logic is correct, but the program did not do what was intended.

** Debugging

Debugging is the process of finding errors, there are four things to try:

- *reading*: Read through the code, check that it says what you meant to say.
- *running*: Run the code and experiment by changing values and running different versions
- *ruminating*: Think about the problem... Is it syntactical, logical, semantic? What info do the error messages give? What about the programs output? What kind of error could cause the current problem? What was last changed before the problem appeared?
- *retreating*: Sometimes, undoing recent changes until the program works again can be helpful.

Breaks are often helpful for thinking through a problem, so does explaining the program to yourself, someone else or even in inanimate object like a rubber duck - /rubber duck debugging/.

** Glossary

| Term                    | Description                                                                                                                                                                                                |
|-------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| bug                     | An error in a program.                                                                                                                                                                                     |
| central processing unit | The heart of any computer. It is what runs the software  that we write; also called “CPU” or “the processor”.                                                                                              |
| compile                 | To translate a program written in a high-level language into a low-level language all at once, in preparation for later execution.                                                                         |
| high-level language     | A programming language like Python that is designed to be easy for humans to read and write.                                                                                                               |
| interactive mode        | A way of using the Python interpreter by typing commands and expressions at the prompt.                                                                                                                    |
| interpret               | To execute a program in a high-level language by translating it one line at a time.                                                                                                                        |
| low-level language      | A programming language that is designed to be easy for a computer to execute; also called “machine code” or “assembly language”.                                                                           |
| machine code            | The lowest-level language for software, which is the language that is directly executed by the central processing unit (CPU).                                                                              |
| main memory             | Stores programs and data. Main memory loses its information when the power is turned off.                                                                                                                  |
| parse                   | To examine a program and analyze the syntactic structure.                                                                                                                                                  |
| portability             | A property of a program that can run on more than one kind of computer.                                                                                                                                    |
| print function          | An instruction that causes the Python interpreter to display avalue on the screen.                                                                                                                         |
| problem solving         | The process of formulating a problem, finding a solution, andexpressing the solution.                                                                                                                      |
| program                 | A set of instructions that specifies a computation.                                                                                                                                                        |
| prompt                  | When a program displays a message and pauses for the user to type someinput to the program.                                                                                                                |
| secondary memory        | Stores programs and data and retains its information evenwhen the power is turned off. Generally slower than main memory. Examples of secondary memory include disk drives and flash memory in USB sticks. |
| semantics               | The meaning of a program.                                                                                                                                                                                  |
| semantic error          | An error in a program that makes it do something other than what the programmer intended.                                                                                                                  |
| source code             | A program in a high-level language                                                                                                                                                                         |

* Chapter 2: Variables, expressions, and statements

