blog/Python/python-for-everybody-notes.html

<div id="outline-container-org517e701" class="outline-3">
<h3 id="org517e701">The building blocks of programs</h3>
<div class="outline-text-3" id="text-org517e701">
<p>
Low-level conceptual patterns applied to all programming languages:
</p>

<ul class="org-ul">
<li><b>Input</b>: Get data from the outside world using input devices</li>
<li><b>Output</b>: Send data to output devices.</li>
<li><b>Sequential execution</b>: Perform statements one after the other</li>
<li><b>Conditional execution</b>: Execute or skip sequences of statements based on conditions</li>
<li><b>Repeated execution</b>: Repeat a set of statements, usually upto a set limit</li>
<li><b>Reuse</b>: Sets of instructions can be named and reused throughout a program</li>
</ul>
</div>
</div>

<div id="outline-container-org7e384dd" class="outline-3">
<h3 id="org7e384dd">What could possibly go wrong?</h3>
<div class="outline-text-3" id="text-org7e384dd">
<p>
Python has many different kinds of error, these indicate something went wrong. If we pass a malformed string to the <code>print()</code> function, we will get a <code>SyntaxError</code> indicating Python doesn't quite understand what we are trying to tell it to do:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>malformed call to print()</label><pre class="src src-python"><span style="font-weight: bold;">print</span>(hello world<span style="font-style: italic;">')</span>
</pre>
</div>

<p>
This results in the following error:
</p>

<pre class="example">
File "&lt;stdin&gt;", line 1
  print(hello world')
              ^
SyntaxError: invalid syntax

</pre>

<p>
Pythons different errors include:
</p>

<ul class="org-ul">
<li><b>Syntax errors</b>: These errors indicate a violation of the languages syntax</li>
<li><b>Logic errors</b>: These errors indicate the syntax is good, but there is a mistake in how we have applied different operations&#x2026;</li>
<li><b>Semantic errors</b>: The syntax is correct, the logic is correct, but the program did not do what was intended.</li>
</ul>
</div>
</div>

<div id="outline-container-org76bc5f1" class="outline-3">
<h3 id="org76bc5f1">Debugging</h3>
<div class="outline-text-3" id="text-org76bc5f1">
<p>
Debugging is the process of finding errors, there are four things to try:
</p>

<ul class="org-ul">
<li><b>reading</b>: Read through the code, check that it says what you meant to say.</li>
<li><b>running</b>: Run the code and experiment by changing values and running different versions</li>
<li><b>ruminating</b>: Think about the problem&#x2026; Is it syntactical, logical, semantic? What info do the error messages give? What about the programs output? What kind of error could cause the current problem? What was last changed before the problem appeared?</li>
<li><b>retreating</b>: Sometimes, undoing recent changes until the program works again can be helpful.</li>
</ul>

<p>
Breaks are often helpful for thinking through a problem, so does explaining the program to yourself, someone else or even in inanimate object like a rubber duck - <i>rubber duck debugging</i>.
</p>
</div>
</div>

<div id="outline-container-orgfbd75bb" class="outline-3">
<h3 id="orgfbd75bb">Glossary</h3>
<div class="outline-text-3" id="text-orgfbd75bb">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bug</td>
<td class="org-left">An error in a program.</td>
</tr>

<tr>
<td class="org-left">central processing unit</td>
<td class="org-left">The heart of any computer. It is what runs the software  that we write; also called “CPU” or “the processor”.</td>
</tr>

<tr>
<td class="org-left">compile</td>
<td class="org-left">To translate a program written in a high-level language into a low-level language all at once, in preparation for later execution.</td>
</tr>

<tr>
<td class="org-left">high-level language</td>
<td class="org-left">A programming language like Python that is designed to be easy for humans to read and write.</td>
</tr>

<tr>
<td class="org-left">interactive mode</td>
<td class="org-left">A way of using the Python interpreter by typing commands and expressions at the prompt.</td>
</tr>

<tr>
<td class="org-left">interpret</td>
<td class="org-left">To execute a program in a high-level language by translating it one line at a time.</td>
</tr>

<tr>
<td class="org-left">low-level language</td>
<td class="org-left">A programming language that is designed to be easy for a computer to execute; also called “machine code” or “assembly language”.</td>
</tr>

<tr>
<td class="org-left">machine code</td>
<td class="org-left">The lowest-level language for software, which is the language that is directly executed by the central processing unit (CPU).</td>
</tr>

<tr>
<td class="org-left">main memory</td>
<td class="org-left">Stores programs and data. Main memory loses its information when the power is turned off.</td>
</tr>

<tr>
<td class="org-left">parse</td>
<td class="org-left">To examine a program and analyze the syntactic structure.</td>
</tr>

<tr>
<td class="org-left">portability</td>
<td class="org-left">A property of a program that can run on more than one kind of computer.</td>
</tr>

<tr>
<td class="org-left">print function</td>
<td class="org-left">An instruction that causes the Python interpreter to display avalue on the screen.</td>
</tr>

<tr>
<td class="org-left">problem solving</td>
<td class="org-left">The process of formulating a problem, finding a solution, andexpressing the solution.</td>
</tr>

<tr>
<td class="org-left">program</td>
<td class="org-left">A set of instructions that specifies a computation.</td>
</tr>

<tr>
<td class="org-left">prompt</td>
<td class="org-left">When a program displays a message and pauses for the user to type someinput to the program.</td>
</tr>

<tr>
<td class="org-left">secondary memory</td>
<td class="org-left">Stores programs and data and retains its information evenwhen the power is turned off. Generally slower than main memory. Examples of secondary memory include disk drives and flash memory in USB sticks.</td>
</tr>

<tr>
<td class="org-left">semantics</td>
<td class="org-left">The meaning of a program.</td>
</tr>

<tr>
<td class="org-left">semantic error</td>
<td class="org-left">An error in a program that makes it do something other than what the programmer intended.</td>
</tr>

<tr>
<td class="org-left">source code</td>
<td class="org-left">A program in a high-level language</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org0a9a046" class="outline-2">
<h2 id="org0a9a046">Chapter 2: Variables, expressions, and statements</h2>
<div class="outline-text-2" id="text-org0a9a046">
</div>
