org/blog/Python/python-for-everybody-notes.org
** Values and types

A ~value~ is a basic piece of data that the computer works with, each value has a data type:

- *string*'s represent sequence of characters, the characters are enclosed in double or single quotes
- *integer*'s represent numeric whole numbers

#+caption: Simple data types
#+begin_src python :results output :exports both :eval no-export
  print(type('I am string'))
  print(type(89))
#+end_src

The ~type()~ function returns the type of the data we pass it, in this case a string is represented by
a class caled ~str~ and integer a class called ~int~:

#+RESULTS:
: <class 'str'>
: <class 'int'>

We also having decimal numbers, these are called *floating-point numbers*:

#+caption: Float data type
#+begin_src python :results output :exports both :eval no-export
  print(type(89.34))
#+end_src

As can be seen, this outputs that the number ~89.34~ is of type ~float~:

#+RESULTS:
: <class 'float'>

** Variables

A *variable* is a name which refers to a value, we use /assignment statements/ to create new variables and
initialise them with values:

#+caption: Declaring variables of various types
#+name: declare-data-types
#+begin_src python :results silent :exports code :session chapter2 :eval no-export
  aString = 'hello world'
  aInteger = 32
  aFloat = 3.14
  aBoolean = True
#+end_src

We have declared four variables above and initialised them to different types using the assignment operator (~=~), we can reference
a variable using its name:

#+caption: Printing out a variable
#+begin_src python :results output :exports both :session chapter2 :eval no-export
  print(aString) # outputs the value of aString to the console
#+end_src

Passing ~aString~ to the ~print()~ function as input prints the value of the variable to the console:

#+RESULTS:
: hello world

We can also check its type with ~type(aString)~:

#+begin_src python :results value :exports results :session chapter2 :eval no-export
  type(aString)
#+end_src

#+RESULTS:
: <class 'str'>

** Variable names and keywords

Variable names should be meaningful and document what the variable is used for:

- they should not be arbitrarily long.
- they can contain both letters and numbers but not special characters.
- they must not start with a number
- uppercase letters are allowed
- underscores are allowed in any position

Trying to give a variable an illegal name will throw a syntax error.

** Statements

A *statement* is an executable unit of code, ~print~ is an expression statement and assignment being another statement.

Scripts may contain sequences of statements, assignment statements produce no output.

** Operators and operands

Operators include: ~+~, ~-~, ~*~, */* and **** perform addition, subtraction, multiplication, division and exponentiation respectively.

In Python3, division returns a float. In Python 2, division returns a truncated integer. To obtain the same answer, use floored division with the ~//~ operator.

#+begin_src python :results output :exports both :eval no-export
  print('10 / 3 = ', (10 / 3))
  print('10 // 3 = ', (10 // 3))
#+end_src

These two statements produce the following output in Python 3:

#+RESULTS:
: 10 / 3 =  3.3333333333333335
: 10 // 3 =  3

** Expressions

** Order of operations

** Modulus operator

** String operations

** Asking the user for input

** Comments

** Debugging

** Glossary



