blog/Python/python-for-everybody-notes.html
<div id="outline-container-org5c2a2e6" class="outline-3">
<h3 id="org5c2a2e6">Values and types</h3>
<div class="outline-text-3" id="text-org5c2a2e6">
<p>
A <code>value</code> is a basic piece of data that the computer works with, each value has a data type:
</p>

<ul class="org-ul">
<li><b>string</b>'s represent sequence of characters, the characters are enclosed in double or single quotes</li>
<li><b>integer</b>'s represent numeric whole numbers</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Simple data types</label><pre class="src src-python"><span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">type</span>(<span style="font-style: italic;">'I am string'</span>))
<span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">type</span>(89))
</pre>
</div>

<p>
The <code>type()</code> function returns the type of the data we pass it, in this case a string is represented by
a class caled <code>str</code> and integer a class called <code>int</code>:
</p>

<pre class="example">
&lt;class 'str'&gt;
&lt;class 'int'&gt;

</pre>

<p>
We also having decimal numbers, these are called <b>floating-point numbers</b>:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Float data type</label><pre class="src src-python"><span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">type</span>(89.34))
</pre>
</div>

<p>
As can be seen, this outputs that the number <code>89.34</code> is of type <code>float</code>:
</p>

<pre class="example">
&lt;class 'float'&gt;

</pre>
</div>
</div>

<div id="outline-container-org7f67805" class="outline-3">
<h3 id="org7f67805">Variables</h3>
<div class="outline-text-3" id="text-org7f67805">
<p>
A <b>variable</b> is a name which refers to a value, we use <i>assignment statements</i> to create new variables and
initialise them with values:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Declaring variables of various types</label><pre class="src src-python" id="org71fe15f"><span style="font-weight: bold; font-style: italic;">aString</span> = <span style="font-style: italic;">'hello world'</span>
<span style="font-weight: bold; font-style: italic;">aInteger</span> = 32
<span style="font-weight: bold; font-style: italic;">aFloat</span> = 3.14
<span style="font-weight: bold; font-style: italic;">aBoolean</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
</pre>
</div>

<p>
We have declared four variables above and initialised them to different types using the assignment operator (<code>=</code>), we can reference
a variable using its name:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>Printing out a variable</label><pre class="src src-python"><span style="font-weight: bold;">print</span>(aString) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">outputs the value of aString to the console</span>
</pre>
</div>

<p>
Passing <code>aString</code> to the <code>print()</code> function as input prints the value of the variable to the console:
</p>

<pre class="example">
hello world

</pre>

<p>
We can also check its type with <code>type(aString)</code>:
</p>

<pre class="example">
&lt;class 'str'&gt;

</pre>
</div>
</div>

<div id="outline-container-orgfd20646" class="outline-3">
<h3 id="orgfd20646">Variable names and keywords</h3>
<div class="outline-text-3" id="text-orgfd20646">
<p>
Variable names should be meaningful and document what the variable is used for:
</p>

<ul class="org-ul">
<li>they should not be arbitrarily long.</li>
<li>they can contain both letters and numbers but not special characters.</li>
<li>they must not start with a number</li>
<li>uppercase letters are allowed</li>
<li>underscores are allowed in any position</li>
</ul>

<p>
Trying to give a variable an illegal name will throw a syntax error.
</p>
</div>
</div>

<div id="outline-container-org74df320" class="outline-3">
<h3 id="org74df320">Statements</h3>
<div class="outline-text-3" id="text-org74df320">
<p>
A <b>statement</b> is an executable unit of code, <code>print</code> is an expression statement and assignment being another statement.
</p>

<p>
Scripts may contain sequences of statements, assignment statements produce no output.
</p>
</div>
</div>

<div id="outline-container-org618e9b0" class="outline-3">
<h3 id="org618e9b0">Operators and operands</h3>
<div class="outline-text-3" id="text-org618e9b0">
<p>
Operators include: <code>+</code>, <code>-</code>, <code>*</code>, <b>/</b> and <b>**</b> perform addition, subtraction, multiplication, division and exponentiation respectively.
</p>

<p>
In Python3, division returns a float. In Python 2, division returns a truncated integer. To obtain the same answer, use floored division with the <code>//</code> operator.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'10 / 3 = '</span>, (10 / 3))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'10 // 3 = '</span>, (10 // 3))
</pre>
</div>

<p>
These two statements produce the following output in Python 3:
</p>

<pre class="example">
10 / 3 =  3.3333333333333335
10 // 3 =  3

</pre>
</div>
</div>

<div id="outline-container-orgf03706e" class="outline-3">
<h3 id="orgf03706e">Expressions</h3>
</div>

<div id="outline-container-orgecd4662" class="outline-3">
<h3 id="orgecd4662">Order of operations</h3>
</div>

<div id="outline-container-orgab4dc42" class="outline-3">
<h3 id="orgab4dc42">Modulus operator</h3>
</div>

<div id="outline-container-org51b9c8b" class="outline-3">
<h3 id="org51b9c8b">String operations</h3>
</div>

<div id="outline-container-org26891a3" class="outline-3">
<h3 id="org26891a3">Asking the user for input</h3>
</div>

<div id="outline-container-org5125e3a" class="outline-3">
<h3 id="org5125e3a">Comments</h3>
</div>

<div id="outline-container-org00d4eac" class="outline-3">
<h3 id="org00d4eac">Debugging</h3>
</div>

<div id="outline-container-org2430c73" class="outline-3">
<h3 id="org2430c73">Glossary</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />
<footer>
  <p>
    Last updated 2022-05-26 Thu 22:42. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </p>
  <p><small>Copyright 2022 Morgan Walsh.</small></p>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
